# 10 чисел (от 0 до 9), начиная с 0 с шагом 1
tuple(range(10))
(0, 1, 2, 3, 4, 5, 6, 7, 8, 9)

# 10 чисел (от 1 до 10), начиная с 1 с шагом 1
tuple(range(1, 11))
(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

# Числа от 0 до 19 с шагом 5
tuple(range(0, 20, 5))
(0, 5, 10, 15)

# Числа от 0 до 20 с шагом 3
tuple(range(0, 20, 3))
(0, 3, 6, 9, 12, 15, 18)

# Числа от 0 до -9 с шагом -1
tuple(range(0, -10, -1))
(0, -1, -2, -3, -4, -5, -6, -7, -8, -9)

# Следующие 2 объекта range не содержат чисел (нет чисел от 0 до -1 с шагом 1)
tuple(range(0))
()
tuple(range(1, 0))
()

tuple(range(1, 0, -1))
(1,)
